cases/channelFlow5200/kOmegaDavidsonNN/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       69;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1;
        startFace       70;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          70;
        startFace       71;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          70;
        startFace       141;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          70;
        startFace       211;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          70;
        startFace       281;
    }
)

// ************************************************************************* //
