cases/channelFlow5200/kOmegaDavidsonNN/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel    kOmegaDavidsonNN;
    turbulence  on;
    printCoeffs on;
    ewmaM       3000;
    usePySR     false;
}
